ns96/STM32DiscVU/Core/Src/main.c
  /*Configure GPIO pins : TP3_Pin NC2_Pin */
  GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pin : DCMI_PWR_EN_Pin */
  GPIO_InitStruct.Pin = DCMI_PWR_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DCMI_PWR_EN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_D4_Pin ARDUINO_D2_Pin EXT_RST_Pin */
  GPIO_InitStruct.Pin = ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
static void Audio_Bridge_Process(int16_t* inBuf, uint32_t samples) {
    static ModemChunk currentChunk;
    static int chunkIdx = 0;
    static float fsk_dc = 0.0f;
    extern float g_FSKGain;
    
    // Invalidate D-Cache for the buffer we just received from DMA
    SCB_InvalidateDCache_by_Addr((uint32_t*)inBuf, samples * 2);


    uint32_t step = 4; // TDM frame is always 4 slots
    uint32_t numModemSteps = samples / (step * 4); // 4-decimation for modem speed
    
    for (uint32_t i = 0; i < numModemSteps; i++) {
        float sumM = 0;
        for(int j=0; j<4; j++) {
            int baseIdx = (i*4 + j) * step;
            extern bool g_InputLineIn;
            if (g_InputLineIn) {
                // Slots 0 & 1 (Line In)
                sumM += (float)inBuf[baseIdx] + (float)inBuf[baseIdx+1];
            } else {
                // Slots 2 & 3 (Mic)
                sumM += (float)inBuf[baseIdx+2] + (float)inBuf[baseIdx+3];
            }
        }
        // Average: 2 channels * 4 decimation steps = 8.0f
        float monoAvg = (sumM / 8.0f) / 32768.0f;
        
        // Loopback: If encoding, override the BRIDGE input with the internal playback signal
        // This ensures the RX modem (waterfall/carrier) "hears" the encoded signal.
        if (g_IsEncoding) {
             float sumL = 0;
             // Determine if we are processing the first or second half of the audio buffer
             // and point to the corresponding half of the playback buffer.
             int16_t* pOutBase = (inBuf < &audio_buffer[AUDIO_BUFFER_SIZE/2]) ? &playback_buffer[0] : &playback_buffer[AUDIO_BUFFER_SIZE/2];
             for(int j=0; j<4; j++) {
                 int baseIdx = (i*4 + j) * step; 
                 // FSK is duplicated on all slots in the playback buffer, reading 0 and 1 is sufficient
                 sumL += (float)pOutBase[baseIdx] + (float)pOutBase[baseIdx+1];
             }
             monoAvg = (sumL / 8.0f) / 32768.0f;
        }

        fsk_dc = 0.999f * fsk_dc + 0.001f * monoAvg;
        float cleanAvg = monoAvg - fsk_dc;
        
        float ganged = cleanAvg * g_FSKGain;
        if (ganged > 1.0f) ganged = 1.0f; else if (ganged < -1.0f) ganged = -1.0f;
        
        // Track max signal for debug (extern float g_MaxSignalLevel)
        extern float g_MaxSignalLevel;
        if (fabsf(ganged) > g_MaxSignalLevel) g_MaxSignalLevel = fabsf(ganged);

        currentChunk.samples[chunkIdx++] = ganged;
        
        if (chunkIdx >= MODEM_CHUNK_SIZE) {
            if (modem_samples_queue_id != NULL) {
                BaseType_t xHigherPriorityTaskWoken = pdFALSE;
                if (xQueueSendFromISR(modem_samples_queue_id, &currentChunk, &xHigherPriorityTaskWoken) != pdPASS) {
                    static uint32_t last_q_err = 0;
                    if (HAL_GetTick() - last_q_err > 1000) {
                        printf("[FSK] Queue FULL! Dropping samples.\r\n");
                        last_q_err = HAL_GetTick();
                    }
                }
                portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            }
            chunkIdx = 0;
        }
    }
}

void BSP_AUDIO_IN_TransferComplete_CallBack(void) {
    // 1. Invalidate input buffer so CPU sees what DMA wrote
    SCB_InvalidateDCache_by_Addr((uint32_t*)&audio_buffer[AUDIO_BUFFER_SIZE / 2], AUDIO_BUFFER_SIZE);

    if (g_IsEncoding) {
        int16_t* pOut = &playback_buffer[AUDIO_BUFFER_SIZE / 2];
        // 4nd-Slot Duplication: Fill all 4 slots with signal
        // This ensures the audio reaches the codec regardless of slot mapping
        for (int i = 0; i < AUDIO_BUFFER_SIZE / 2; i += 4) {
            int16_t sample = FSK_FIFO_Pop();
            pOut[i]   = sample; // Slot 0
            pOut[i+1] = sample; // Slot 1
            pOut[i+2] = sample; // Slot 2
            pOut[i+3] = sample; // Slot 3
        }
        
        static uint32_t lastDbgTC = 0;
        if (HAL_GetTick() - lastDbgTC > 1000) {
            lastDbgTC = HAL_GetTick();
            printf("[IRQ] TC Encoding Active (FIFO Sample: %d)\n", pOut[0]);
            // Re-assert volume/unmute once per second just in case
            BSP_AUDIO_OUT_SetVolume(90);
            BSP_AUDIO_OUT_SetMute(AUDIO_MUTE_OFF);
        }
    } else {
        extern bool g_InputLineIn;
        int16_t* pIn = &audio_buffer[AUDIO_BUFFER_SIZE / 2];
        int16_t* pOut = &playback_buffer[AUDIO_BUFFER_SIZE / 2];
        for (int i = 0; i < AUDIO_BUFFER_SIZE / 2; i += 4) {
             int16_t srcL = g_InputLineIn ? pIn[i]   : pIn[i+2];
             int16_t srcR = g_InputLineIn ? pIn[i+1] : pIn[i+3];

             // Digital Monitor Attenuation (-26dB pad)
             // The FSK decoder requires the loud +30dB analog hardware gain, which 
             // unfortunately digitizes the ADC's thermal noise floor as loud hiss.
             // By attenuating the headphone passthrough by 95%, we push the hiss
             // into total silence, while still letting the user monitor the loud FSK tones.
             if (g_InputLineIn) {
                 srcL = (int16_t)((float)srcL * 0.05f);
                 srcR = (int16_t)((float)srcR * 0.05f);
             }

             pOut[i]   = srcL;
             pOut[i+1] = srcR;
             pOut[i+2] = srcL;
             pOut[i+3] = srcR;
        }
    }
    
