ns96/STM32DiscVU/Core/Src/main.c
    // 2. Clean playback buffer so DMA sees what CPU wrote
    SCB_CleanDCache_by_Addr((uint32_t*)&playback_buffer[AUDIO_BUFFER_SIZE / 2], AUDIO_BUFFER_SIZE);
    
    Audio_Bridge_Process(&audio_buffer[AUDIO_BUFFER_SIZE / 2], AUDIO_BUFFER_SIZE / 2);
    audio_ready |= 1; 
}

void BSP_AUDIO_IN_HalfTransfer_CallBack(void) {
    // 1. Invalidate input buffer so CPU sees what DMA wrote
    SCB_InvalidateDCache_by_Addr((uint32_t*)&audio_buffer[0], AUDIO_BUFFER_SIZE);

    if (g_IsEncoding) {
        int16_t* pOut = &playback_buffer[0];
        // 4nd-Slot Duplication: Fill all 4 slots with signal
        for (int i = 0; i < AUDIO_BUFFER_SIZE / 2; i += 4) {
            int16_t sample = FSK_FIFO_Pop();
            pOut[i]   = sample; 
            pOut[i+1] = sample; 
            pOut[i+2] = sample; 
            pOut[i+3] = sample; 
        }
    } else {
        extern bool g_InputLineIn;
        int16_t* pIn = &audio_buffer[0];
        int16_t* pOut = &playback_buffer[0];
        for (int i = 0; i < AUDIO_BUFFER_SIZE / 2; i += 4) {
             int16_t srcL = g_InputLineIn ? pIn[i]   : pIn[i+2];
             int16_t srcR = g_InputLineIn ? pIn[i+1] : pIn[i+3];

             // Digital Monitor Attenuation (-26dB pad)
             // The FSK decoder requires the loud +30dB analog hardware gain, which 
             // unfortunately digitizes the ADC's thermal noise floor as loud hiss.
             // By attenuating the headphone passthrough by 95%, we push the hiss
             // into total silence, while still letting the user monitor the loud FSK tones.
             if (g_InputLineIn) {
                 srcL = (int16_t)((float)srcL * 0.05f);
                 srcR = (int16_t)((float)srcR * 0.05f);
             }

             pOut[i]   = srcL;
             pOut[i+1] = srcR;
             pOut[i+2] = srcL;
             pOut[i+3] = srcR;
        }
    }
    
    // 2. Clean playback buffer so DMA sees what CPU wrote
    SCB_CleanDCache_by_Addr((uint32_t*)&playback_buffer[0], AUDIO_BUFFER_SIZE);

    Audio_Bridge_Process(&audio_buffer[0], AUDIO_BUFFER_SIZE / 2);
    audio_ready |= 2; 
}

void BSP_AUDIO_IN_Error_CallBack(void) {
    Error_Handler();
}

// Modem Task: Process FSK Logic in high-priority background
extern FSK_Modem g_Modem;
extern bool g_ShowFSK;
extern void addFSKChar(char c);

void StartModemTask(void const * argument) {
    printf("[MODEM_TASK] Started\r\n");
    
    // Explicit Init here in the task context
    extern float g_BaudCorrectionFactor;
    FSK_Config fskCfg = {1200.0f, 2200.0f, 1200.0f, 12000.0f, 0.1f, g_BaudCorrectionFactor, false};
    FSK_Modem_Init(&g_Modem, fskCfg);
    
    bool lastCarrier = false;
    for(;;) {
        ModemChunk rxChunk;
        if (xQueueReceive(modem_samples_queue_id, &rxChunk, portMAX_DELAY) == pdTRUE) {
            static uint32_t last_rx_debug = 0;
            if (HAL_GetTick() - last_rx_debug > 2000) {
                 float pwr = 0.0f;
                 for(int k=0; k<MODEM_CHUNK_SIZE; k++) {
                     float v = rxChunk.samples[k];
                     pwr += (v > 0 ? v : -v);
                 }
                 int scaledPwr = (int)(pwr * 1000.0f / 64.0f);
                 int scaledSNR = (int)(g_Modem.lastSNR * 10.0f);
                 printf("[MODEM] Chunk Rx OK. Pwr:%d SNR:%d.%d Carr:%d\r\n", 
                        scaledPwr, scaledSNR/10, scaledSNR%10, g_Modem.carrier);
                 last_rx_debug = HAL_GetTick();
            }

            extern volatile bool g_IsEncoding;
            if (g_ShowFSK && !g_IsEncoding) {
                for (int i = 0; i < MODEM_CHUNK_SIZE; i++) {
                    char c = FSK_Modem_ProcessRX(&g_Modem, rxChunk.samples[i]);
                    if (c) addFSKChar(c);
                    
                    if (lastCarrier && !g_Modem.carrier) {
                        const char* msg = "\n### NOCARRIER\n";
                        while(*msg) addFSKChar(*msg++);
                    }
                    lastCarrier = g_Modem.carrier;
                }
            } else {
                lastCarrier = false; // Reset if FSK is hidden OR encoding is active
            }
        }
    }
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_HOST */
  MX_USB_HOST_Init();
  /* USER CODE BEGIN 5 */
  printf("[TASK] Started\r\n");

  // Initialize SDRAM first as in JMinimodem-Cube
  printf("[SDRAM] Initializing...\r\n");
  if (BSP_SDRAM_Init() != SDRAM_OK) {
      printf("[SDRAM] Init FAILED!\r\n");
  } else {
      printf("[SDRAM] Init OK\r\n");
  }

  printf("[FATFS] Mounting SD card (delayed)...\r\n");
  if (f_mount(&SDFatFS, (TCHAR const*)SDPath, 0) != FR_OK) {
      printf("[FATFS] Mount FAILED!\r\n");
  } else {
      printf("[FATFS] Mount OK\r\n");
  }

  printf("[LCD/AUDIO] Initializing...\r\n");
  Visualizer_Init();
  printf("[LCD/AUDIO] OK\r\n");

  /* Infinite loop */
  uint32_t last_heartbeat = 0;
  printf("StartDefaultTask: Runtime Loop Started.\r\n");
  for(;;)
  {
    if (HAL_GetTick() - last_heartbeat > 2000) {
        printf("Heartbeat: StartDefaultTask is running... (audio_ready: %d)\r\n", audio_ready);
        last_heartbeat = HAL_GetTick();
    }

    extern volatile bool g_IsEncoding;
    if (audio_ready & 2) { // First Half (HT)
        audio_ready &= ~2;
        int16_t* pBuf = g_IsEncoding ? &playback_buffer[0] : &audio_buffer[0];
        Visualizer_ProcessAudio(pBuf, AUDIO_BUFFER_SIZE/2);
    }
    if (audio_ready & 1) { // Second Half (TC)
        audio_ready &= ~1;
        int16_t* pBuf = g_IsEncoding ? &playback_buffer[AUDIO_BUFFER_SIZE/2] : &audio_buffer[AUDIO_BUFFER_SIZE/2];
        Visualizer_ProcessAudio(pBuf, AUDIO_BUFFER_SIZE/2);
    }
    
    static uint32_t last_update = 0;
    if (HAL_GetTick() - last_update > 5000) {
        printf("[DEBUG] Main Loop Heartbeat.\r\n");
        last_update = HAL_GetTick();
    }

    Visualizer_Update();
    
    osDelay(10); // Aggressively reduce CPU load
  }
  /* USER CODE END 5 */
}

